Resources/canonical_library/wsdl/BAPI_REQUISITION_DELETE.PortType.wsdl

<?xml version="1.0" encoding="UTF-8"?><wsdl:definitions name="BAPI_REQUISITION_DELETE" targetNamespace="urn:sap-com:document:sap:rfc:functions" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"><wsdl:types><xsd:schema targetNamespace="urn:sap-com:document:sap:rfc:functions" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns="urn:sap-com:document:sap:rfc:functions"><xsd:element name="BAPI_REQUISITION_DELETE.Response"><xsd:complexType><xsd:all><xsd:element name="REQUISITION_ITEMS_TO_DELETE"><xsd:annotation><xsd:documentation>Items to be Deleted/Closed</xsd:documentation></xsd:annotation><xsd:complexType><xsd:sequence><xsd:element name="item" type="BAPIEBAND" minOccurs="0" maxOccurs="unbounded"/></xsd:sequence></xsd:complexType></xsd:element><xsd:element name="RETURN" minOccurs="0"><xsd:annotation><xsd:documentation>Return Messages</xsd:documentation></xsd:annotation><xsd:complexType><xsd:sequence><xsd:element name="item" type="BAPIRETURN" minOccurs="0" maxOccurs="unbounded"/></xsd:sequence></xsd:complexType></xsd:element></xsd:all></xsd:complexType></xsd:element><xsd:element name="BAPI_REQUISITION_DELETE"><xsd:complexType><xsd:all><xsd:element name="NUMBER"><xsd:annotation><xsd:documentation>Purchase Requisition Number</xsd:documentation></xsd:annotation><xsd:simpleType><xsd:restriction base="xsd:string"><xsd:maxLength value="10"/></xsd:restriction></xsd:simpleType></xsd:element><xsd:element name="REQUISITION_ITEMS_TO_DELETE"><xsd:annotation><xsd:documentation>Items to be Deleted/Closed</xsd:documentation></xsd:annotation><xsd:complexType><xsd:sequence><xsd:element name="item" type="BAPIEBAND" minOccurs="0" maxOccurs="unbounded"/></xsd:sequence></xsd:complexType></xsd:element><xsd:element name="RETURN" minOccurs="0"><xsd:annotation><xsd:documentation>Return Messages</xsd:documentation></xsd:annotation><xsd:complexType><xsd:sequence><xsd:element name="item" type="BAPIRETURN" minOccurs="0" maxOccurs="unbounded"/></xsd:sequence></xsd:complexType></xsd:element></xsd:all></xsd:complexType></xsd:element><xsd:complexType name="BAPIEBAND"><xsd:annotation><xsd:documentation>Transfer Structure: Delete/Close Requisition</xsd:documentation></xsd:annotation><xsd:sequence><xsd:element name="PREQ_ITEM" minOccurs="0"><xsd:annotation><xsd:documentation>Item Number of Purchase Requisition</xsd:documentation></xsd:annotation><xsd:simpleType><xsd:restriction base="xsd:string"><xsd:maxLength value="5"/><xsd:pattern value="\d+"/></xsd:restriction></xsd:simpleType></xsd:element><xsd:element name="DELETE_IND" minOccurs="0"><xsd:annotation><xsd:documentation>Deletion Indicator in Purchasing Document</xsd:documentation></xsd:annotation><xsd:simpleType><xsd:restriction base="xsd:string"><xsd:maxLength value="1"/></xsd:restriction></xsd:simpleType></xsd:element><xsd:element name="CLOSED" minOccurs="0"><xsd:annotation><xsd:documentation>Purchase Requisition Closed</xsd:documentation></xsd:annotation><xsd:simpleType><xsd:restriction base="xsd:string"><xsd:maxLength value="1"/></xsd:restriction></xsd:simpleType></xsd:element></xsd:sequence></xsd:complexType><xsd:complexType name="BAPIRETURN"><xsd:annotation><xsd:documentation>Return Parameter</xsd:documentation></xsd:annotation><xsd:sequence><xsd:element name="TYPE" minOccurs="0"><xsd:annotation><xsd:documentation>Message type: S Success, E Error, W Warning, I Info, A Abort</xsd:documentation></xsd:annotation><xsd:simpleType><xsd:restriction base="xsd:string"><xsd:maxLength value="1"/></xsd:restriction></xsd:simpleType></xsd:element><xsd:element name="CODE" minOccurs="0"><xsd:annotation><xsd:documentation>Message code</xsd:documentation></xsd:annotation><xsd:simpleType><xsd:restriction base="xsd:string"><xsd:maxLength value="5"/></xsd:restriction></xsd:simpleType></xsd:element><xsd:element name="MESSAGE" minOccurs="0"><xsd:annotation><xsd:documentation>Message Text</xsd:documentation></xsd:annotation><xsd:simpleType><xsd:restriction base="xsd:string"><xsd:maxLength value="220"/></xsd:restriction></xsd:simpleType></xsd:element><xsd:element name="LOG_NO" minOccurs="0"><xsd:annotation><xsd:documentation>Application Log: Log Number</xsd:documentation></xsd:annotation><xsd:simpleType><xsd:restriction base="xsd:string"><xsd:maxLength value="20"/></xsd:restriction></xsd:simpleType></xsd:element><xsd:element name="LOG_MSG_NO" minOccurs="0"><xsd:annotation><xsd:documentation>Application log: Internal message serial number</xsd:documentation></xsd:annotation><xsd:simpleType><xsd:restriction base="xsd:string"><xsd:maxLength value="6"/><xsd:pattern value="\d+"/></xsd:restriction></xsd:simpleType></xsd:element><xsd:element name="MESSAGE_V1" minOccurs="0"><xsd:annotation><xsd:documentation>Message Variable</xsd:documentation></xsd:annotation><xsd:simpleType><xsd:restriction base="xsd:string"><xsd:maxLength value="50"/></xsd:restriction></xsd:simpleType></xsd:element><xsd:element name="MESSAGE_V2" minOccurs="0"><xsd:annotation><xsd:documentation>Message Variable</xsd:documentation></xsd:annotation><xsd:simpleType><xsd:restriction base="xsd:string"><xsd:maxLength value="50"/></xsd:restriction></xsd:simpleType></xsd:element><xsd:element name="MESSAGE_V3" minOccurs="0"><xsd:annotation><xsd:documentation>Message Variable</xsd:documentation></xsd:annotation><xsd:simpleType><xsd:restriction base="xsd:string"><xsd:maxLength value="50"/></xsd:restriction></xsd:simpleType></xsd:element><xsd:element name="MESSAGE_V4" minOccurs="0"><xsd:annotation><xsd:documentation>Message Variable</xsd:documentation></xsd:annotation><xsd:simpleType><xsd:restriction base="xsd:string"><xsd:maxLength value="50"/></xsd:restriction></xsd:simpleType></xsd:element></xsd:sequence></xsd:complexType></xsd:schema></wsdl:types><wsdl:message name="BAPI_REQUISITION_DELETE.Input"><wsdl:part name="parameters" element="rfc:BAPI_REQUISITION_DELETE" xmlns:rfc="urn:sap-com:document:sap:rfc:functions"/></wsdl:message><wsdl:message name="BAPI_REQUISITION_DELETE.Output"><wsdl:part name="parameters" element="rfc:BAPI_REQUISITION_DELETE.Response" xmlns:rfc="urn:sap-com:document:sap:rfc:functions"/></wsdl:message><wsdl:portType name="BAPI_REQUISITION_DELETE.PortType"><wsdl:operation name="BAPI_REQUISITION_DELETE"><wsdl:input message="rfc:BAPI_REQUISITION_DELETE.Input" xmlns:rfc="urn:sap-com:document:sap:rfc:functions"/><wsdl:output message="rfc:BAPI_REQUISITION_DELETE.Output" xmlns:rfc="urn:sap-com:document:sap:rfc:functions"/></wsdl:operation></wsdl:portType><wsdl:binding name="BAPI_REQUISITION_DELETE.PortTypeBinding" type="rfc:BAPI_REQUISITION_DELETE.PortType" xmlns:rfc="urn:sap-com:document:sap:rfc:functions"><soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"/><wsdl:operation name="BAPI_REQUISITION_DELETE"><soap:operation soapAction="http://sap.com/xi/WebService/soap1.1" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"/><wsdl:input><soap:body use="literal" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"/></wsdl:input><wsdl:output><soap:body use="literal" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"/></wsdl:output></wsdl:operation></wsdl:binding></wsdl:definitions>